Revit 2026 API

# BuiltInFailuresImageFailures Class

---

Failures about Image.

SystemObject Autodesk.Revit.DBBuiltInFailuresImageFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ImageFailures
```
```vb
Public NotInheritable Class ImageFailures
```
```cpp
public ref class ImageFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ImageFailures = class end
```

The BuiltInFailuresImageFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadViewType | Image Instances can't be placed in 3D Views. |
|  | InvalidHeight | The image height must be must be no more than 30000 feet. |
|  | InvalidWidth | The image width must be must be no more than 30000 feet. |

#### Reference

Autodesk.Revit.DB Namespace